#include <stdio.h>

///////////////////////////////////////////////
//  数组指针
///////////////////////////////////////////////
void Test1()
{
    int arr[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    // int *p = arr;
    int (*p)[10] = &arr;
    int i = 0;
    for (i = 0; i < 10; i++)
    {
        printf("%d ", (*p)[i]);
    }
    printf("\n");
}

void Print(int (*arr)[3], int x, int y)
{
    int i = 0;
    int j = 0;
    for (i = 0; i < x; i++)
    {
        for (j = 0; j < y; j++)
        {
            printf("%d ", *(*(arr+i)+j));
        }
        printf("\n");
    }
}
void Test2()
{
    int arr[3][3] = {{1, 2, 3} , {4, 5, 6}, {7, 8, 9}};
    Print(arr, 3, 3);
}

void Test(int arr[])
{}

///////////////////////////////////////////////
//  一维数组传参
///////////////////////////////////////////////
//void Test(int arr[10])
//{}
//ok
//void Test(int *arr)
//{}
//ok
//void _Test(int *arr[20])
//{}
//ok
//void _Test(int **arr)
//{}
//ok

///////////////////////////////////////////////
//  二维数组传参
///////////////////////////////////////////////
//void Test(int* arr)
//{}
//no
//void Test(int* arr[5])
//{}
//no
//void Test(int (*arr)[5])
//{}
//ok
//void Test(int **arr)
//{}
//no
int main()
{
    // int (*arr[10])[5];
    ///////////////////////////////////////////////
    //  一维数组
    ///////////////////////////////////////////////
    //int arr[10] = {0};
    //int *arr2[20] = {0};
    //Test(arr);
    //_Test(arr2);
    ///////////////////////////////////////////////
    //  二维数组
    ///////////////////////////////////////////////
    int arr[3][5];
    Test(arr);
    return 0;
}
